Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--mapserver_overview.tmx
Source language: en
Languages: ja

source: Web Service
ja: Web サービス

source: MapServer is an `Open Source <https://opensource.org/>`_ geographic data rendering engine written in C. Beyond browsing GIS data, MapServer allows you create "geographic image maps", that is, maps that can direct users to web content. For example, the Minnesota DNR `Recreation Compass <http://www.dnr.state.mn.us/maps/compass.html>`_ provides users with more than 10,000 web pages, reports and maps via a single application. The same application serves as a "map engine" for other portions of the site, providing spatial context where needed.
ja: MapServer は C 言語で記述された`オープンソース<https://opensource.org/>`_ のジオグラフィックデータレンダリングエンジンです。GISデータのブラウズはもちろん、MapServer はユーザにコンテンツを直接伝えるためのグラフィックイメージ地図を作ることが出来ます。例として、ミネソタ DNR `Recreation Compass <http://www.dnr.state.mn.us/maps/compass.html>`_ は10,000を超えるウェブページ、レポートおよび地図を１つのアプリケーションを通じて提供しています。同様のアプリケーションは空間情報を提供するサイトのマップエンジンとしても利用されています。

source: MapServer was originally developed by the University of Minnesota (UMN) ForNet project in cooperation with NASA, and the Minnesota Department of Natural Resources (MNDNR). Later it was hosted by the TerraSIP project, a NASA sponsored project between the UMN and a consortium of land management interests.
ja: MapServer は NASA、Minnesota Department of Natural Resources (MNDNR) の協力のもとでミネソタ大学 (UMN) ForNet プロジェクトにより当初開発されました。後に UMN と土地管理業者コンソーシアムで作られた、NASA のスポンサーによる TerraSIP プロジェクトが管理することになりました。

source: MapServer is now a project of `OSGeo <https://www.osgeo.org>`_, and is maintained by a growing number of developers (nearing 20) from around the world. It is supported by a diverse group of organizations that fund enhancements and maintenance, and administered within OSGeo by the MapServer Project Steering Committee made up of developers and other contributors.
ja: 現在、MapServer は `OSGeo <https://www.osgeo.org>`_ の１プロジェクトとして管理されています。今後増え続ける世界中からの開発者(現在約20人)によって維持管理されています。基金強化およびメインテナンスなどの様々な機関によってサポートされています。開発者とコントリビュータによって構成される MapServer Project Steering Committee として OSGeo のなかで運営されています。

source: Core Features
ja: 主要機能

source: Advanced cartographic output
ja: 高度な地図出力

source: Scale dependent feature drawing and application execution
ja: 縮尺に依存したフィーチャ描画および機能実行

source: Feature labeling including label collision mediation
ja: 重複を回避するフィーチャのラベル付け

source: TrueType font support for labeling and symbolization
ja: ラベリングとシンボル描画のための TrueType フォントサポート

source: Map element automation (scalebar, reference map, and legend)
ja: マップ要素の自動化 (スケールバー、マップ参照、凡例)

source: Thematic mapping using logical or regular expression-based classes
ja: 論理または正規表現ベースのクラスを利用した主題マッピング

source: Plugable renderer support with drivers for AGG, Cairo and others
ja: AGG、Cairoその他のドライバーでのプラガブルなレンダラーサポート

source: Special provisioning for tiled output generation
ja: タイル化された出力生成のための特別なプロビジョニング

source: Mask Layers
ja: マスクレイヤ

source: Precise Symbol Placement
ja: 正確なシンボル配置

source: Complex Multi Label/Symbol Symbology
ja: 複雑な複数ラベル・シンボルのシンボロジー

source: Vector Fields
ja: ベクタフィールド

source: Label Leader Offsetting
ja: ラベル先頭のオフセット

source: SVG Symbology
ja: SVG シンボロジー

source: Multiple Font Support
ja: 複数フォントサポート

source: Dynamic Heatmaps
ja: 動的ヒートマップ

source: UTF Grid Support
ja: UTF Grid サポート

source: Layer Compositing
ja: レイヤ合成

source: Sophisticated spatial query support
ja: 洗練された空間クエリサポート

source: Identify features by attributes, point, bounding box or geometry across one or more layers
ja: 属性、ポイント、バウンディングボックス、ジオメトリによる、単一もしくは複数レイヤにまたがるフィーチャの識別

source: Support for raster queries
ja: ラスタクエリのサポート

source: Fully customizable, template driven output
ja: 十分にカスタマイズ可能なテンプレート駆動の出力

source: OGR-based query output generation
ja: OGR ベースのクエリ出力生成

source: Support for popular scripting and development environments
ja: 人気のあるスクリプトや開発環境のサポート

source: PHP, Python, Perl, Ruby, Java, and .NET
ja: PHP, Python, Perl, Ruby, Java, .NET

source: Cross-platform support
ja: クロスプラットフォーム対応

source: Linux, Windows, Mac OS X, Solaris, and more
ja: Linux, Windows, Mac OS X, Solaris その他

source: A multitude of raster and vector data formats
ja: 多数のラスタ・ベクタデータフォーマット

source: Native support for ESRI shapefiles, PostGIS and Oracle Spatial
ja: ESRI シェープファイル, PostGIS, Oracle Spatial のネイティブサポート

source: Many other formats via GDAL and OGR
ja: GDAL 及び OGR 経由の、他の多くのフォーマット

source: Map projection support
ja: 地図投影サポート

source: On-the-fly map projection with 1000s of projections through the Proj.4 library
ja: Proj.4 ライブラリ使用による、1000を超える投影法でのオンザフライ地図投影

source: Implemented Standards
ja: 実装されている標準規格

source: Support of numerous Open Geospatial Consortium (OGC) standards
ja: 多数の Open Geospatial Consortium (OGC) 標準規格のサポート

source: |WMS| (client/server)
ja: |WMS| (クライアントサーバー)

source: |WFS| (non-transactional, client/server)
ja: |WFS| (非トランザクショナル、クライアント/サーバ)

source: INSPIRE View Service compliant
ja: INSPIRE View Service 準拠

source: Demo
ja: デモ

source: Documentation
ja: ドキュメント

source: `MapServer 7.0 Documentation <../../../mapserver/doc/index.html>`_
ja: `MapServer 7.0 ドキュメント <../../../mapserver/doc/index.html>`_

source: Details
ja: 詳細

source: **Website:** https://mapserver.org
ja: **Webサイト:** https://mapserver.org

source: **Licence:** `MIT-style license <https://mapserver.org/copyright.html#license>`_
ja: **ライセンス:** `MIT-style license <https://mapserver.org/copyright.html#license>`_

source: **Software Version:** |version-mapserver|
ja: **ソフトウェアバージョン:** |version-mapserver|

source: **Supported Platforms:** Windows, Linux, Mac
ja: **対応プラットフォーム:** Windows, Linux, Mac

source: **API Interfaces:** C, PHP, Python, Perl, Ruby, Java, and .NET
ja: **API インターフェイス:** C, PHP, Python, Perl, Ruby, Java, .NET

source: **Support:** https://mapserver.org/community/
ja: **サポート:** https://mapserver.org/community/

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/mapserver_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/mapserver_quickstart>`
